"espk" = "Porta altoparlante Apple";
"ispk" = "Integrato";
"emic" = "Porta microfono";
"imic" = "Integrato";
"hdpn" = "Porta auricolari";
"lini" = "Porta ingresso audio";
"lino" = "Porta uscita audio";
"spdi" = "Porta digital-in ottica";
"spdo" = "Porta digital-out ottica";
"pci " = "Scheda PCI";
"usb " = "USB";
"1394" = "Firewire";
"wrls" = "AirPort";
"ntwk" = "Dispositivo network";
"blue" = "Bluetooth";
"bluh" = "Cuffie Bluetooth";
"blus" = "Cuffia auricolare Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
